In [2]:
import pandas as pd
import numpy as np
from pathlib import Path

In [12]:
df6 = pd.DataFrame({
    'name': ['Peter', 'Paul', 'Mary'],
    'food': ['fish', 'beans', 'bread']},
    columns=['name', 'food'])
df7 = pd.DataFrame({
    'name': ['Mary', 'Joseph'],
    'drink': ['wine', 'beer']},
    columns=['name', 'drink'])

df6.set_index('name', inplace=True)
df7.set_index('name', inplace=True)

In [15]:
df6

        food
name
Peter   fish
Paul   beans
Mary   bread

In [16]:
df7

       drink
name
Mary    wine
Joseph  beer

In [20]:
df8 = pd.merge(df6, df7, how='outer', left_index=True, right_index=True)
df8

         food drink
name
Joseph    NaN  beer
Mary    bread  wine
Paul    beans   NaN
Peter    fish   NaN

In [23]:
df8.loc[:, ['food']].dropna(axis='rows')

        food
name
Mary   bread
Paul   beans
Peter   fish

In [24]:
from pathlib import Path
birth_path = Path(r"C:\Users\user\Desktop\div\data\births.csv")
cars_path = Path(r"C:\Users\user\Desktop\div\data\car-sales-extended.csv")

birth = pd.read_csv(birth_path)
cars = pd.read_csv(cars_path)

In [70]:
birth.head()

   year  month  day gender  births
0  1969      1  1.0      F    4046
1  1969      1  1.0      M    4440
2  1969      1  2.0      F    4454
3  1969      1  2.0      M    4548
4  1969      1  3.0      F    4548

In [73]:
birth[birth.loc[:, 'gender'] == 'F']

       year  month  day gender  births
0      1969      1  1.0      F    4046
2      1969      1  2.0      F    4454
4      1969      1  3.0      F    4548
6      1969      1  4.0      F    4440
8      1969      1  5.0      F    4192
...     ...    ...  ...    ...     ...
15537  2008      8  NaN      F  182713
15539  2008      9  NaN      F  179696
15541  2008     10  NaN      F  175314
15543  2008     11  NaN      F  158939
15545  2008     12  NaN      F  173215

[7776 rows x 5 columns]

In [68]:
# birth.groupby('gender')['births'].sum()
birth.groupby('gender')['births'].mean()

gender
F     9521.067773
M    10003.674559
Name: births, dtype: float64

In [63]:
birth.groupby(['year', 'month'])['births'].sum().mean()

birth.groupby(['year', 'month']).agg({
    'births' : 'sum'
}).mean()

births    316196.620833
dtype: float64

In [61]:
birth.groupby('year')['births'].sum()

birth.groupby('year').agg({
    'births' : 'sum',
}).head()

# birth.groupby('year').agg(
#     b = ('births' , 'sum')
# )

       births
year
1969  3600206
1970  3737800
1971  3563548
1972  3266235
1973  3146125

In [43]:
birth.head(3)

   year  month  day gender  births
0  1969      1  1.0      F    4046
1  1969      1  1.0      M    4440
2  1969      1  2.0      F    4454

In [46]:
birth.groupby(['year','month','day'])['births'].sum().mean()

np.float64(9315.837319941853)

In [29]:
df = pd.DataFrame({
    'key': ['A', 'B', 'C', 'A', 'B', 'C'],
    'data': range(6)
    })

df

  key  data
0   A     0
1   B     1
2   C     2
3   A     3
4   B     4
5   C     5

In [36]:
# df['data'].mean()
df.groupby('key')['data'].mean()

df.groupby('key').agg({
    'data' : 'mean'
})

df.groupby('key').agg(
    data_agg = ('data', 'mean')
)

     data_agg
key
A         1.5
B         2.5
C         3.5

In [74]:
rng = np.random.RandomState(0)
df = pd.DataFrame({
    'key': ['A', 'B', 'C', 'A', 'B', 'C'],
    'data1': range(6),
    'data2': rng.randint(0, 10, 6)
    })
df

  key  data1  data2
0   A      0      5
1   B      1      0
2   C      2      3
3   A      3      3
4   B      4      7
5   C      5      9

In [77]:
df.groupby('key')['data1'].sum()

df.groupby('key').agg({
    'data1' : 'sum'
})

     data1
key
A        3
B        5
C        7

In [79]:
df.groupby('key')[['data1', 'data2']].sum()

df.groupby('key').agg({
    'data1' : 'sum',
    'data2' : 'sum',
})

     data1  data2
key
A        3      8
B        5      7
C        7     12

In [84]:
df.groupby('key').agg({
    'data1' : 'sum',
    'data2' : 'mean'
})

     data1  data2
key
A        3    4.0
B        5    3.5
C        7    6.0

In [86]:
df

  key  data1  data2
0   A      0      5
1   B      1      0
2   C      2      3
3   A      3      3
4   B      4      7
5   C      5      9

In [88]:
df.groupby('key').agg({
    'data1' : ['sum', 'mean'],
    'data2' : ['max', 'min']
})

    data1      data2
      sum mean   max min
key
A       3  1.5     5   3
B       5  2.5     7   0
C       7  3.5     9   3

In [90]:
cars.head()

     Make Colour  Odometer (KM)  Doors  Price
0   Honda  White          35431      4  15323
1     BMW   Blue         192714      5  19943
2   Honda  White          84714      4  28343
3  Toyota  White         154365      4  13434
4  Nissan   Blue         181577      3  14043

In [94]:
cars.groupby('Make').agg({
    'Price' : ['min', 'mean', 'max']
})

cars.groupby(['Make', 'Colour']).agg({
    'Price' : 'mean'
})

                      Price
Make   Colour
BMW    Black   24706.000000
       Blue    28845.058824
       Green   19438.750000
       Red     22510.230769
       White   29255.675676
Honda  Black   13926.031250
       Blue    14107.019231
       Green   17320.444444
       Red     15180.615385
       White   14460.403226
Nissan Black   13601.000000
       Blue    14078.483333
       Green   12509.562500
       Red     13069.166667
       White   13710.505618
Toyota Black   16680.750000
       Blue    16069.764228
       Green   13585.783784
       Red     13848.756757
       White   15887.872611

In [96]:
birth.head()

   year  month  day gender  births
0  1969      1  1.0      F    4046
1  1969      1  1.0      M    4440
2  1969      1  2.0      F    4454
3  1969      1  2.0      M    4548
4  1969      1  3.0      F    4548

In [106]:
# birth.groupby('gender')['births'].mean()
# birth.groupby('gender').agg({
#     'births' : 'mean'
# })
gender_avg = birth.groupby('gender')['births'].transform('mean')
birth['gender_avg'] = gender_avg
birth.head()

   year  month  day gender  births    gender_avg
0  1969      1  1.0      F    4046   9521.067773
1  1969      1  1.0      M    4440  10003.674559
2  1969      1  2.0      F    4454   9521.067773
3  1969      1  2.0      M    4548  10003.674559
4  1969      1  3.0      F    4548   9521.067773

In [108]:
birth['births'] - birth['gender_avg']

0         -5475.067773
1         -5563.674559
2         -5067.067773
3         -5455.674559
4         -4973.067773
             ...
15542    173215.325441
15543    149417.932227
15544    155464.325441
15545    163693.932227
15546    171231.325441
Length: 15547, dtype: float64

In [113]:
cars.shape

(1000, 5)

In [112]:
cars.groupby('Make')['Price'].mean().to_frame()

               Price
Make
BMW     27089.830000
Honda   14514.200658
Nissan  13658.368687
Toyota  15628.160804

In [116]:
cars_make_mean = cars.groupby('Make')['Price'].transform('mean')
cars['make_mean'] = cars_make_mean
cars.head()

     Make Colour  Odometer (KM)  Doors  Price     make_mean
0   Honda  White          35431      4  15323  14514.200658
1     BMW   Blue         192714      5  19943  27089.830000
2   Honda  White          84714      4  28343  14514.200658
3  Toyota  White         154365      4  13434  15628.160804
4  Nissan   Blue         181577      3  14043  13658.368687

In [118]:
m = cars['Price'] < cars['make_mean']
cars[m]

       Make Colour  Odometer (KM)  Doors  Price     make_mean
1       BMW   Blue         192714      5  19943  27089.830000
3    Toyota  White         154365      4  13434  15628.160804
6    Toyota   Blue         163453      4   8473  15628.160804
8    Nissan  White         130538      4   9374  13658.368687
11   Nissan  Green          17119      4   6160  13658.368687
..      ...    ...            ...    ...    ...           ...
991   Honda   Blue         235985      4   9184  14514.200658
993  Nissan  Black         162523      4   4696  13658.368687
996  Nissan  White         155144      3   5716  13658.368687
998   Honda  White         215883      4   4001  14514.200658
999  Toyota   Blue         248360      4  12732  15628.160804

[567 rows x 6 columns]

In [120]:
cars['Price'] - cars['make_mean'] < 0

0      False
1       True
2      False
3       True
4      False
       ...
995    False
996     True
997    False
998     True
999     True
Length: 1000, dtype: bool

In [137]:
df

  key  data1  data2
0   A      0      5
1   B      1      0
2   C      2      3
3   A      3      3
4   B      4      7
5   C      5      9

In [138]:
df.groupby('key')['data1'].mean()

key
A    1.5
B    2.5
C    3.5
Name: data1, dtype: float64

In [ ]:
def saxla(balaca_df):
	return balaca_df['data1'].mean() > 2
df.groupby('key').filter(saxla)

  key  data1  data2
1   B      1      0
2   C      2      3
4   B      4      7
5   C      5      9

In [139]:
# cars.groupby('Make')['Price'].mean()
umumi_ort = cars['Price'].mean()

def ortalamadan_kic_saxla(balaca_df):
    ort = balaca_df['Price'].mean()
    return ort<umumi_ort
cars.groupby('Make').filter(ortalamadan_kic_saxla)

       Make Colour  Odometer (KM)  Doors  Price     make_mean
0     Honda  White          35431      4  15323  14514.200658
2     Honda  White          84714      4  28343  14514.200658
3    Toyota  White         154365      4  13434  15628.160804
4    Nissan   Blue         181577      3  14043  13658.368687
5     Honda    Red          42652      4  23883  14514.200658
..      ...    ...            ...    ...    ...           ...
995  Toyota  Black          35820      4  32042  15628.160804
996  Nissan  White         155144      3   5716  13658.368687
997  Nissan   Blue          66604      4  31570  13658.368687
998   Honda  White         215883      4   4001  14514.200658
999  Toyota   Blue         248360      4  12732  15628.160804

[900 rows x 6 columns]